Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_cam.c
/**
 ******************************************************************************
 * @file    bl702_cam.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_cam.h"
#include "bl702.h"
#include "bl702_glb.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  CAM
 *  @{
 */

/** @defgroup  CAM_Private_Macros
 *  @{
 */

/*@} end of group CAM_Private_Macros */

/** @defgroup  CAM_Private_Types
 *  @{
 */

/*@} end of group CAM_Private_Types */

/** @defgroup  CAM_Private_Variables
 *  @{
 */
static intCallback_Type *camIntCbfArra[CAM_INT_ALL] = {NULL};

/*@} end of group CAM_Private_Variables */

/** @defgroup  CAM_Global_Variables
 *  @{
 */

/*@} end of group CAM_Global_Variables */

/** @defgroup  CAM_Private_Fun_Declaration
 *  @{
 */

/*@} end of group CAM_Private_Fun_Declaration */

/** @defgroup  CAM_Private_Functions
 *  @{
 */

/*@} end of group CAM_Private_Functions */

/** @defgroup  CAM_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  Camera module init
                                                                                *
                                                                                * @param  cfg: Camera configuration structure pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Init(CAM_CFG_Type *cfg) {
  uint32_t tmpVal;

  CHECK_PARAM(IS_CAM_SW_MODE_TYPE(cfg->swMode));
  CHECK_PARAM(IS_CAM_FRAME_MODE_TYPE(cfg->frameMode));
  CHECK_PARAM(IS_CAM_YUV_MODE_TYPE(cfg->yuvMode));
  CHECK_PARAM(IS_CAM_FRAME_ACTIVE_POL(cfg->framePol));
  CHECK_PARAM(IS_CAM_LINE_ACTIVE_POL(cfg->linePol));
  CHECK_PARAM(IS_CAM_BURST_TYPE(cfg->burstType));
  CHECK_PARAM(IS_CAM_SENSOR_MODE_TYPE(cfg->camSensorMode));

  /* Disable clock gate */
  GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_CAM);

  /* Set camera configuration */
  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE);
  tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DVP_ENABLE);
  BL_WR_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE, tmpVal);

  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_SW_MODE, cfg->swMode);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_INTERLV_MODE, cfg->frameMode);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_FRAM_VLD_POL, cfg->framePol);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_LINE_VLD_POL, cfg->linePol);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_HBURST, cfg->burstType);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_DVP_MODE, cfg->camSensorMode);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_DVP_WAIT_CYCLE, cfg->waitCount);

  switch (cfg->yuvMode) {
  case CAM_YUV422:
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DROP_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_SUBSAMPLE_EN);
    break;

  case CAM_YUV420_EVEN:
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DROP_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_SUBSAMPLE_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_SUBSAMPLE_EVEN);
    break;

  case CAM_YUV420_ODD:
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DROP_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_SUBSAMPLE_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_SUBSAMPLE_EVEN);
    break;

  case CAM_YUV400_EVEN:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_DROP_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DROP_EVEN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_SUBSAMPLE_EN);
    break;

  case CAM_YUV400_ODD:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_DROP_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_DROP_EVEN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_SUBSAMPLE_EN);
    break;

  default:
    break;
  }

