Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_cam.c
  BL_WR_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE, tmpVal);

  /* Set frame count to issue interrupt at sw mode */
  tmpVal = BL_RD_REG(CAM_BASE, CAM_INT_CONTROL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_FRAME_CNT_TRGR_INT, cfg->swIntCnt);
  BL_WR_REG(CAM_BASE, CAM_INT_CONTROL, tmpVal);

  /* Set camera memory start address, memory size and frame size in burst */
  BL_WR_REG(CAM_BASE, CAM_DVP2AHB_ADDR_START_0, cfg->memStart0 & 0xFFFFFFF0);

  if (cfg->burstType == CAM_BURST_TYPE_SINGLE) {
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_MEM_BCNT_0, cfg->memSize0 / 4);
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_FRAME_BCNT_0, cfg->frameSize0 / 4);
  } else if (cfg->burstType == CAM_BURST_TYPE_INCR4) {
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_MEM_BCNT_0, cfg->memSize0 / 16);
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_FRAME_BCNT_0, cfg->frameSize0 / 16);
  } else if (cfg->burstType == CAM_BURST_TYPE_INCR8) {
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_MEM_BCNT_0, cfg->memSize0 / 32);
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_FRAME_BCNT_0, cfg->frameSize0 / 32);
  } else if (cfg->burstType == CAM_BURST_TYPE_INCR16) {
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_MEM_BCNT_0, cfg->memSize0 / 64);
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_FRAME_BCNT_0, cfg->frameSize0 / 64);
  }

  if (!cfg->frameMode) {
    BL_WR_REG(CAM_BASE, CAM_DVP2AHB_ADDR_START_1, cfg->memStart1 & 0xFFFFFFF0);

    if (cfg->burstType == CAM_BURST_TYPE_SINGLE) {
      BL_WR_REG(CAM_BASE, CAM_DVP2AHB_MEM_BCNT_1, cfg->memSize1 / 4);
      BL_WR_REG(CAM_BASE, CAM_DVP2AHB_FRAME_BCNT_1, cfg->frameSize1 / 4);
    } else if (cfg->burstType == CAM_BURST_TYPE_INCR4) {
      BL_WR_REG(CAM_BASE, CAM_DVP2AHB_MEM_BCNT_1, cfg->memSize1 / 16);
      BL_WR_REG(CAM_BASE, CAM_DVP2AHB_FRAME_BCNT_1, cfg->frameSize1 / 16);
    } else if (cfg->burstType == CAM_BURST_TYPE_INCR8) {
      BL_WR_REG(CAM_BASE, CAM_DVP2AHB_MEM_BCNT_1, cfg->memSize1 / 32);
      BL_WR_REG(CAM_BASE, CAM_DVP2AHB_FRAME_BCNT_1, cfg->frameSize1 / 32);
    } else if (cfg->burstType == CAM_BURST_TYPE_INCR16) {
      BL_WR_REG(CAM_BASE, CAM_DVP2AHB_MEM_BCNT_1, cfg->memSize1 / 64);
      BL_WR_REG(CAM_BASE, CAM_DVP2AHB_FRAME_BCNT_1, cfg->frameSize1 / 64);
    }
  }

  /* Clear interrupt */
  BL_WR_REG(CAM_BASE, CAM_DVP_FRAME_FIFO_POP, 0xFFFF0);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(CAM_IRQn, CAM_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  Deinit camera module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Deinit(void) {
  // GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_CAM);
}

/****************************************************************************/ /**
                                                                                * @brief  Enable camera module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Enable(void) {
  uint32_t tmpVal;

  /* Enable camera module */
  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE);
  tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_DVP_ENABLE);
  BL_WR_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Disable camera module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Disable(void) {
  uint32_t tmpVal;

  /* Disable camera module */
  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE);
  tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DVP_ENABLE);
  BL_WR_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Camera clock gate function
                                                                                *
                                                                                * @param  enable: Enable or disable
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Clock_Gate(BL_Fun_Type enable) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_DVP_PIX_CLK_CG, enable);
  BL_WR_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Camera hsync crop function
                                                                                *
                                                                                * @param  start: Valid hsync start count
                                                                                * @param  end: Valid hsync end count
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Hsync_Crop(uint16_t start, uint16_t end) { BL_WR_REG(CAM_BASE, CAM_HSYNC_CONTROL, (start << 16) + end); }

/****************************************************************************/ /**
                                                                                * @brief  Camera vsync crop function
                                                                                *
                                                                                * @param  start: Valid vsync start count
                                                                                * @param  end: Valid vsync end count
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Vsync_Crop(uint16_t start, uint16_t end) { BL_WR_REG(CAM_BASE, CAM_VSYNC_CONTROL, (start << 16) + end); }

/****************************************************************************/ /**
                                                                                * @brief  Camera set total valid pix count in a line function
                                                                                *
                                                                                * @param  count: Count value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Set_Hsync_Total_Count(uint16_t count) {
  uint32_t tmpVal;

