Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_cam.c
  tmpVal = BL_RD_REG(CAM_BASE, CAM_FRAME_SIZE_CONTROL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_TOTAL_HCNT, count);
  BL_WR_REG(CAM_BASE, CAM_FRAME_SIZE_CONTROL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Camera set total valid line count in a frame function
                                                                                *
                                                                                * @param  count: Count value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Set_Vsync_Total_Count(uint16_t count) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(CAM_BASE, CAM_FRAME_SIZE_CONTROL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_TOTAL_VCNT, count);
  BL_WR_REG(CAM_BASE, CAM_FRAME_SIZE_CONTROL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Get one camera frame in interleave mode
                                                                                *
                                                                                * @param  info: Interleave mode camera frame infomation pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Interleave_Get_Frame_Info(CAM_Interleave_Frame_Info *info) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP_STATUS_AND_ERROR);

  info->validFrames   = BL_GET_REG_BITS_VAL(tmpVal, CAM_FRAME_VALID_CNT_0);
  info->curFrameAddr  = BL_RD_REG(CAM_BASE, CAM_FRAME_START_ADDR0_0);
  info->curFrameBytes = BL_RD_REG(CAM_BASE, CAM_FRAME_BYTE_CNT0_0);
  info->status        = tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  Get one camera frame in planar mode
                                                                                *
                                                                                * @param  info: Planar mode camera frame infomation pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Planar_Get_Frame_Info(CAM_Planar_Frame_Info *info) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP_STATUS_AND_ERROR);

  info->validFrames0   = BL_GET_REG_BITS_VAL(tmpVal, CAM_FRAME_VALID_CNT_0);
  info->validFrames1   = BL_GET_REG_BITS_VAL(tmpVal, CAM_FRAME_VALID_CNT_1);
  info->curFrameAddr0  = BL_RD_REG(CAM_BASE, CAM_FRAME_START_ADDR0_0);
  info->curFrameAddr1  = BL_RD_REG(CAM_BASE, CAM_FRAME_START_ADDR1_0);
  info->curFrameBytes0 = BL_RD_REG(CAM_BASE, CAM_FRAME_BYTE_CNT0_0);
  info->curFrameBytes1 = BL_RD_REG(CAM_BASE, CAM_FRAME_BYTE_CNT1_0);
  info->status         = tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  Get available count 0 of frames
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Frames count
                                                                                *
                                                                                *******************************************************************************/
uint8_t CAM_Get_Frame_Count_0(void) { return BL_GET_REG_BITS_VAL(BL_RD_REG(CAM_BASE, CAM_DVP_STATUS_AND_ERROR), CAM_FRAME_VALID_CNT_0); }

/****************************************************************************/ /**
                                                                                * @brief  Get available count 1 of frames
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Frames count
                                                                                *
                                                                                *******************************************************************************/
uint8_t CAM_Get_Frame_Count_1(void) { return BL_GET_REG_BITS_VAL(BL_RD_REG(CAM_BASE, CAM_DVP_STATUS_AND_ERROR), CAM_FRAME_VALID_CNT_1); }

/****************************************************************************/ /**
                                                                                * @brief  Pop one camera frame in interleave mode
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Interleave_Pop_Frame(void) {
  /* Pop one frame */
  BL_WR_REG(CAM_BASE, CAM_DVP_FRAME_FIFO_POP, 1);
}

/****************************************************************************/ /**
                                                                                * @brief  Pop one camera frame in planar mode
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Planar_Pop_Frame(void) {
  /* Pop one frame */
  BL_WR_REG(CAM_BASE, CAM_DVP_FRAME_FIFO_POP, 3);
}

/****************************************************************************/ /**
                                                                                * @brief  CAMERA Enable Disable Interrupt
                                                                                *
                                                                                * @param  intType: CAMERA Interrupt Type
                                                                                * @param  intMask: Enable or Disable
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_IntMask(CAM_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_CAM_INT_TYPE(intType));
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

  tmpVal = BL_RD_REG(CAM_BASE, CAM_INT_CONTROL);

  switch (intType) {
  case CAM_INT_NORMAL_0:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_0_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_0_EN);
    }

    break;

  case CAM_INT_NORMAL_1:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_1_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_1_EN);
    }

    break;

  case CAM_INT_MEMORY_OVERWRITE_0:
  case CAM_INT_MEMORY_OVERWRITE_1:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_MEM_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_MEM_EN);
    }

    break;

  case CAM_INT_FRAME_OVERWRITE_0:
  case CAM_INT_FRAME_OVERWRITE_1:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FRAME_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_FRAME_EN);
    }

    break;

  case CAM_INT_FIFO_OVERWRITE_0:
  case CAM_INT_FIFO_OVERWRITE_1:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FIFO_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_FIFO_EN);
    }

    break;

  case CAM_INT_VSYNC_CNT_ERROR:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_VCNT_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_VCNT_EN);
    }

    break;

