Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_cam.c
  case CAM_INT_HSYNC_CNT_ERROR:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_HCNT_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_HCNT_EN);
    }

    break;

  case CAM_INT_ALL:
    if (intMask == UNMASK) {
      /* Enable all interrupt */
      tmpVal |= 0x7F;
    } else {
      /* Disable all interrupt */
      tmpVal &= 0xFFFFFF80;
    }

    break;

  default:
    break;
  }

  BL_WR_REG(CAM_BASE, CAM_INT_CONTROL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  CAMERA Interrupt Clear
                                                                                *
                                                                                * @param  intType: CAMERA Interrupt Type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_IntClr(CAM_INT_Type intType) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP_FRAME_FIFO_POP);

  switch (intType) {
  case CAM_INT_NORMAL_0:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_CLR_0);
    break;

  case CAM_INT_NORMAL_1:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_CLR_1);
    break;

  case CAM_INT_MEMORY_OVERWRITE_0:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_MEM_CLR_0);
    break;

  case CAM_INT_MEMORY_OVERWRITE_1:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_MEM_CLR_1);
    break;

  case CAM_INT_FRAME_OVERWRITE_0:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FRAME_CLR_0);
    break;

  case CAM_INT_FRAME_OVERWRITE_1:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FRAME_CLR_1);
    break;

  case CAM_INT_FIFO_OVERWRITE_0:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FIFO_CLR_0);
    break;

  case CAM_INT_FIFO_OVERWRITE_1:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FIFO_CLR_1);
    break;

  case CAM_INT_VSYNC_CNT_ERROR:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_VCNT_CLR_0);
    break;

  case CAM_INT_HSYNC_CNT_ERROR:
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_HCNT_CLR_0);
    break;

  case CAM_INT_ALL:
    tmpVal = 0xFFFF0;

  default:
    break;
  }

  BL_WR_REG(CAM_BASE, CAM_DVP_FRAME_FIFO_POP, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Install camera interrupt callback function
                                                                                *
                                                                                * @param  intType: CAMERA interrupt type
                                                                                * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_Int_Callback_Install(CAM_INT_Type intType, intCallback_Type *cbFun) {
  /* Check the parameters */
  CHECK_PARAM(IS_CAM_INT_TYPE(intType));

  camIntCbfArra[intType] = cbFun;
}

/****************************************************************************/ /**
                                                                                * @brief  CAM hardware mode with frame start address wrap to memory address start function enable or disable
                                                                                *
                                                                                * @param  enable: Enable or disable
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void CAM_HW_Mode_Wrap(BL_Fun_Type enable) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_HW_MODE_FWRAP, enable);
  BL_WR_REG(CAM_BASE, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Camera interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM_IRQHandler(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(CAM_BASE, CAM_DVP_STATUS_AND_ERROR);

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_NORMAL_INT_0)) {
    CAM_IntClr(CAM_INT_NORMAL_0);

