Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_cam.c
    if (camIntCbfArra[CAM_INT_NORMAL_0] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_NORMAL_0]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_NORMAL_INT_1)) {
    CAM_IntClr(CAM_INT_NORMAL_1);

    if (camIntCbfArra[CAM_INT_NORMAL_1] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_NORMAL_1]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_MEM_INT_0)) {
    CAM_IntClr(CAM_INT_MEMORY_OVERWRITE_0);

    if (camIntCbfArra[CAM_INT_MEMORY_OVERWRITE_0] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_MEMORY_OVERWRITE_0]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_MEM_INT_1)) {
    CAM_IntClr(CAM_INT_MEMORY_OVERWRITE_1);

    if (camIntCbfArra[CAM_INT_MEMORY_OVERWRITE_1] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_MEMORY_OVERWRITE_1]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_FRAME_INT_0)) {
    CAM_IntClr(CAM_INT_FRAME_OVERWRITE_0);

    if (camIntCbfArra[CAM_INT_FRAME_OVERWRITE_0] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_FRAME_OVERWRITE_0]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_FRAME_INT_1)) {
    CAM_IntClr(CAM_INT_FRAME_OVERWRITE_1);

    if (camIntCbfArra[CAM_INT_FRAME_OVERWRITE_1] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_FRAME_OVERWRITE_1]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_FIFO_INT_0)) {
    CAM_IntClr(CAM_INT_FIFO_OVERWRITE_0);

    if (camIntCbfArra[CAM_INT_FIFO_OVERWRITE_0] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_FIFO_OVERWRITE_0]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_FIFO_INT_1)) {
    CAM_IntClr(CAM_INT_FIFO_OVERWRITE_1);

    if (camIntCbfArra[CAM_INT_FIFO_OVERWRITE_1] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_FIFO_OVERWRITE_1]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_HCNT_INT)) {
    CAM_IntClr(CAM_INT_HSYNC_CNT_ERROR);

    if (camIntCbfArra[CAM_INT_HSYNC_CNT_ERROR] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_HSYNC_CNT_ERROR]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_VCNT_INT)) {
    CAM_IntClr(CAM_INT_VSYNC_CNT_ERROR);

    if (camIntCbfArra[CAM_INT_VSYNC_CNT_ERROR] != NULL) {
      /* call the callback function */
      camIntCbfArra[CAM_INT_VSYNC_CNT_ERROR]();
    }
  }
}
#endif

/*@} end of group CAM_Public_Functions */

/*@} end of group CAM */

/*@} end of group BL702_Peripheral_Driver */
